"appName" = "Inlaider (th)";


"popup.command.placeholder.typeACommand" = "พิมพ์คำสั่ง...";
"popup.command.placeholder.typeACommandOrEnterQuit" = "พิมพ์คำสั่งหรือลด Enter เพื่อปิด...";
"popup.command.placeholder.typeACommandOrEnterPaste" = "พิมพ์คำสั่งหรือลด Enter เพื่อวางผลลัพธ์";
"popup.navigation.focusCanvas.label" = "⌘ ⬆️ — สลับไปที่ตัวแก้ไข";
"popup.navigation.focusCommandline.label" = "⌘ ⬇️ — สลับไปที่บรรทัดคำสั่ง";
"popup.shortcut.clearCanvas" = "⌘⌫ ล้างตัวแก้ไข";
"popup.shortcut.copyCanvas" = "⌘C คัดลอกเนื้อหาตัวแก้ไข";
"popup.shortcut.copyCanvasOrEnterCopy" = "⌘C หรือลด Enter คัดลอกเนื้อหาตัวแก้ไข";
"popup.shortcut.enterPaste" = "ลด Enter วางไปที่";
"popup.shortcut.esc" = "Esc ปิดไปที่";

"show" = "แสดง";
"about" = "เกี่ยวกับโปรแกรม";
"quit" = "ออก";
"close" = "ปิด";
"cancel" = "ยกเลิก";
"save" = "บันทึก";
"ok" = "ตกลง";
"settings" = "การตั้งค่า";
"copied" = "คัดลอกแล้ว";

"settings.section.general.title" = "ทั่วไป";
"settings.accessibility.title" = "สิทธิ์การเข้าถึง";
"settings.accessibility.description" = "สิทธิ์นี้จำเป็นสำหรับการอ่านข้อความที่เลือกโดยอัตโนมัติและแทรกผลลัพธ์ที่ประมวลผลกลับไปยังช่องข้อความเดิม\nหากไม่มีการเข้าถึง แอปพลิเคชันจะใช้คลิปบอร์ดในการส่งข้อมูล";
"settings.inlaiderShortcut.label" = "ทางลัดคีย์บอร์ดสำหรับ Inlaider";
"settings.LaunchAtLogin.label" = "เปิดใช้งานเมื่อเริ่มต้น";

"settings.section.ownAPIKeys.title" = "คีย์ API ของคุณเอง";
"provider.apiKey.title" = "คีย์ API";
"provider.apiKey.placeholder" = "ใส่คีย์ API ที่นี่";
"provider.models.title" = "โมเดล";
"provider.models.new.placeholder" = "เพิ่มชื่อโมเดล";

"settings.section.customPrompts.title" = "การแทนที่พรอมต์";
"prompts.general.title" = "พรอมต์ทั่วไป";
"prompts.replacements.title" = "การแทนที่พรอมต์";
"prompts.replacements.replaceWhat.label" = "แทนที่";
"prompts.replacements.model.label" = "โมเดล";
"prompts.replacements.replaceWith.label" = "ด้วยพรอมต์";
"prompts.replacements.error.exists.message" = "การแทนที่คำสั่ง '%@' มีอยู่แล้ว";

"about.ThirdPartyLicenses" = "ใบอนุญาตของบุคคลที่สาม";
"about.VisitOnGithub" = "ดูบน GitHub";
"about.version" = "เวอร์ชัน %@";

"error.title" = "ข้อผิดพลาด";